config/InformationRegisters/КоэффициентыМонитораПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>КоэффициентыМонитораПродаж</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДеньНедели</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяТочка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/InformationRegisters/КоэффициентыМонитораПродаж/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаполнитьКоэффициентыНаСервере()
	
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Подразделения.Ссылка
		|ИЗ
		|	Справочник.Подразделения КАК Подразделения
		|ГДЕ
		|	Подразделения.ЭтоГруппа = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	Подразделения.Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Подразделение = ВыборкаДетальныеЗаписи.Ссылка;
		
		Для день=1 По 7 Цикл
			Кэффициент12 = РегистрыСведений.КоэффициентыМонитораПродаж.СоздатьМенеджерЗаписи();
			Кэффициент12.Период = НачалоДня(ТекущаяДата());
			Кэффициент12.Магазин = Подразделение;
			Кэффициент12.ВремяТочка = 12;
			Кэффициент12.ДеньНедели = день;
			Кэффициент12.Коэффициент = 0.2;
			Кэффициент12.Записать();
			
			Кэффициент15 = РегистрыСведений.КоэффициентыМонитораПродаж.СоздатьМенеджерЗаписи();
			Кэффициент15.Период = НачалоДня(ТекущаяДата());
			Кэффициент15.Магазин = Подразделение;
			Кэффициент15.ВремяТочка = 15;
			Кэффициент15.Коэффициент = 0.6;
			Кэффициент15.ДеньНедели = день;
			Кэффициент15.Записать();
			
			Кэффициент18 = РегистрыСведений.КоэффициентыМонитораПродаж.СоздатьМенеджерЗаписи();
			Кэффициент18.Период = НачалоДня(ТекущаяДата());
			Кэффициент18.Магазин = Подразделение;
			Кэффициент18.ВремяТочка = 18;
			Кэффициент18.Коэффициент = 0.9;
			Кэффициент18.ДеньНедели = день;
			Кэффициент18.Записать();
			
		КонецЦикла;
		
		Сообщить(Подразделение);
		
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
	
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьКоэффициенты(Команда)
	ЗаполнитьКоэффициентыНаСервере();
КонецПроцедуры


&НаСервере
Процедура ОчиститьРСКоффициентыНаСервере()
	РС = РегистрыСведений.КоэффициентыМонитораПродаж.СоздатьНаборЗаписей();
	РС.Записать();	
КонецПроцедуры


&НаКлиенте
Процедура ОчиститьРСКоффициенты(Команда)
	ОчиститьРСКоффициентыНаСервере();
КонецПроцедуры
